uhnp/src/DataProcessors/ГрупповоеИзменениеЭлементовОтчета/ГрупповоеИзменениеЭлементовОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрупповоеИзменениеЭлементовОтчета</name>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/Enums/ВидыКурсов/ВидыКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКурсов</name>
  <enumValues>
    <name>СреднийКурсЗаПериод</name>
  </enumValues>
  <enumValues>
    <name>СреднийКурсЗаПериодМСФО</name>
  </enumValues>
  <enumValues>
    <name>КурсНаНачалоПериода</name>
  </enumValues>
  <enumValues>
    <name>КурсНаКонецПериода</name>
  </enumValues>
  <enumValues>
    <name>КурсНаМоментНачисления</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеУказанноеВДокументе</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеФинансовый</name>
    <comment>Использовать реквизит показателя &quot;НеФинансовый&quot;</comment>
  </enumValues>
  <enumValues>
    <name>КурсНаКонецПредыдущегоПериода</name>
  </enumValues>
  <enumValues>
    <name>СреднийКурсЗаПредыдущийПериод</name>
  </enumValues>
  <enumValues>
    <name>СреднийКурсЗаПериодЦБ</name>
  </enumValues>
  <enumValues>
    <name>СреднийКурсЗаПредыдущийПериодЦБ</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыЗначенийПоказателейОтчетов/ТипыЗначенийПоказателейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗначенийПоказателейОтчетов</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыИтоговПоказателя/ВидыИтоговПоказателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИтоговПоказателя</name>
  <enumValues>
    <name>Минимум</name>
  </enumValues>
  <enumValues>
    <name>Максимум</name>
  </enumValues>
  <enumValues>
    <name>Среднее</name>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>НеРассчитывается</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/ГрупповоеИзменениеЭлементовОтчета/Forms/ГрупповоеИзменениеЭлементов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ТаблицаРедактируемыхДанных;
	
	Если Параметры.МассивОбъектов = Неопределено Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru='Непосредственное открытие этой формы не предусмотрено.'");
	КонецЕсли;
	
	Объект.ВидОтчета = Параметры.ВидОтчета;
	ТипЭлемента = Параметры.ТипЭлемента;
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураНачальногоЗаполнения = ТекОбъект.ОпределитьСтруктуруИзменяемыхДанных(Параметры.ТипЭлемента, Параметры.МассивОбъектов, ТаблицаРедактируемыхДанных);
	АдресТаблицыРедактируемыхДанных = ПоместитьВоВременноеХранилище(ТаблицаРедактируемыхДанных, УникальныйИдентификатор);
	
	Для Каждого Элемент Из СтруктураНачальногоЗаполнения Цикл
		ЭтаФорма[Элемент.Ключ] = Элемент.Значение;
	КонецЦикла;
	
	ИзменениеСтрок=Параметры.ТипЭлемента="Строка";
	
	Заголовок = СтрШаблон(НСтр("ru = 'Групповое изменение %1'"), ?(ИзменениеСтрок, НСтр("ru = 'строк'"), НСтр("ru = 'показателей'")));
	
	Элементы.ИзменениеГруппирующейСтроки.Видимость=ИзменениеСтрок;
	
	ЗаполнитьСпискиВидовИтогов();
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ИзменитьЭлементы() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзменитьЭлементы()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ТекОбъект.ЗаписатьИзмененныеДанные(ЭтаФорма, ПолучитьИзВременногоХранилища(АдресТаблицыРедактируемыхДанных), ТипЭлемента);
	
КонецФункции

&НаСервере
Процедура ОтобразитьПараметрыКонвертации()
	
	Элементы.КонвертацияВалюты.Видимость = НЕ НеФинансовый;
	
	Если ВидКурса=Перечисления.ВидыКурсов.КурсНаМоментНачисления Тогда
		Элементы.ПанельСвязанныеПоказатели.ТекущаяСтраница=Элементы.ДатаКурса;
	ИначеЕсли ВидКурса=Перечисления.ВидыКурсов.ЗначениеУказанноеВДокументе Тогда
		Элементы.ПанельСвязанныеПоказатели.ТекущаяСтраница=Элементы.ПоказателиКурса;
	Иначе
		Элементы.ПанельСвязанныеПоказатели.ТекущаяСтраница=Элементы.ПрочиеКурсы;
	КонецЕсли;
		
КонецПроцедуры // ОтобразитьПараметрыКонвертации() 

&НаКлиенте
Процедура ВидКурсаПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	ОтобразитьПараметрыКонвертации();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппирующаяСтрокаПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеИзменения(Элемент)
	
	ЭтаФорма[Элемент.Имя+"Изменить"]=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПоказателяПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособОбработкиПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)

	ПриИзмененииТипаЗначения();
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры
	
&НаСервере
Процедура ПриИзмененииТипаЗначения()
	
	ВидИтогаИзменить = Истина;
	
	Если ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда
		
		ВидИтога = Перечисления.ВидыИтоговПоказателя.Сумма;
		
	Иначе
		
		Валютный = Ложь;
		ВалютныйИзменить = Истина;
		ПересчитыватьВалютнуюСумму = Ложь;
		ПересчитыватьВалютнуюСуммуИзменить = Истина;
		НеСуммируется = Истина;
		НеСуммируетсяИзменить = Истина;
		КонтролируемыйПоказатель = Ложь;
		КонтролируемыйПоказательИзменить = Истина;
		
		ВидИтога = Перечисления.ВидыИтоговПоказателя.НеРассчитывается;
		
	КонецЕсли;
	
	ЗаполнитьСпискиВидовИтогов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВидовИтогов()
	
	Элементы.ВидИтога.СписокВыбора.Очистить();
	Элементы.ВидИтога.СписокВыбора.Добавить(Перечисления.ВидыИтоговПоказателя.НеРассчитывается);
	Элементы.ВидИтога.СписокВыбора.Добавить(Перечисления.ВидыИтоговПоказателя.Минимум);
	Элементы.ВидИтога.СписокВыбора.Добавить(Перечисления.ВидыИтоговПоказателя.Максимум);
	
	Если ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда
		Элементы.ВидИтога.СписокВыбора.Добавить(Перечисления.ВидыИтоговПоказателя.Среднее);
		Элементы.ВидИтога.СписокВыбора.Добавить(Перечисления.ВидыИтоговПоказателя.Сумма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРаскрытияПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИтогаПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НеМасштабируетсяПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НеФинансовыйПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
	Если НеФинансовый Тогда
		
		ВидКурсаИзменить=Ложь;
		СвязанныйПоказательИзменить=Ложь;
		ПоказателиДляКурсовВалютИзменить=Ложь;
		
	КонецЕсли;
	
	ОтобразитьПараметрыКонвертации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнутригрупповойПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныйПоказательПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиДляКурсовВалютПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриАктуализацииПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаПоложительногоОтклоненияПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриходРасходПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДвиженияДенежныхСредствПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютныйПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитыватьВалютнуюСуммуПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредназначениеПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделениеПоПроектамПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НеСуммируетсяПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролируемыйПоказательПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитываетсяПослеКонвертацииПриИзменении(Элемент)
	
	ИзменитьСостояниеИзменения(Элемент);

КонецПроцедуры
